// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "心爱的宝宝",  // 同上...
        "这是我们在一起的",
        "你的第一个生日哦",
        "很抱歉不能在你身边",
        "真想陪你一起过生日呀",
        "不过换个角度想想",
        "我还要帮你过很多很多的生日",
        "永远永远",
        "陪在你身边呀",
        "真的好爱你哇宝宝",
        "有时候呢",
        "我会惹你不开心",
        "很对不起呀",
        "可我真的最爱最爱你了",
        "我想把最好的都给你",
        "跟你在一起就是我最期待的生活",
        "也不过就三年嘛",
        "我等得起呀",
        "一定一定会一直在一起的",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给我":"./imgs/1.jpg",     
        "心爱的宝宝":"./imgs/2.jpg", 
        "这是我们在一起的":"./imgs/3.jpg",
        "你的第一个生日哦":"./imgs/4.jpg",
        "很抱歉不能在你身边":"./imgs/5.jpg",
        "真想陪你一起过生日呀":"./imgs/6.jpg",
        "不过换个角度想想":"./imgs/7.jpg",
        "我还要帮你过很多很多的生日":"./imgs/8.jpg",
        "永远永远":"./imgs/9.jpg",
        "陪在你身边呀":"./imgs/10.jpg",
        "真的好爱你哇宝宝":"./imgs/11.jpg",
        "有时候呢":"./imgs/12.jpg",
        "我会惹你不开心":"./imgs/13.jpg",
        "很对不起呀":"./imgs/14.jpg",
        "可我真的最爱最爱你了":"./imgs/15.jpg",
        "我想把最好的都给你":"./imgs/16.jpg",
        "跟你在一起就是我最期待的生活":"./imgs/17.jpg",
        "也不过就三年嘛":"./imgs/18.jpg",
        "我等得起呀":"./imgs/19.jpg",
        "一定一定会一直在一起的":"./imgs/20.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐呀老婆",
        story: "A MESSAGE FOR YOU",
    }
};
